Написать компьютерную программу, содержащую

 - Описание классов vect и matr, содержащие поля int dim, double*v (double*a или double**a ), класс vect - int num, static int count;

 - Конструкторы и деструктор, (в классе vect - содержащие вывод сообщений о выполненном действии);

 - Набор оператор-функций (компонентных и внешних) для операций векторной алгебры, (в классе vect - содержащие вывод сообщений о выполненных действиях):

     v+v, v-v, -v, v*v, k*v, v=v,

     m+m, m-m, -m, m*m, k*m, m=m,

     m*v.

 - Функцию main, содержащую сценарий работы с векторами и матрицами